package test.java.ua.lviv.iot.regex;

import org.junit.jupiter.api.Assertions;
import org.junit.jupiter.api.BeforeEach;
import org.junit.jupiter.api.Test;

import main.java.ua.lviv.iot.regex.StringProcessor;

class StringProcessorTest {

  StringProcessor proc;

  @BeforeEach
  void beforeEach() {
    proc = new StringProcessor();
  }
  
  @Test
  void testNone() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan("",1),""
    );
  }
  
  @Test
  void testSheduleMonday() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Розклад: ІР-12"
        + "Поточний тиждень: 03.03 - 09.03"
        + "Навчання по: Знаменнику"
        + "Мої налаштування:  Чисельник - I підгрупа"
        + "Останнє оновлення: 08.03 22:34:10"
        + "~~~~~~~~~~~~~"
        + "1 Алгоритмізація та програмування, частина 2"
        + "🎓 Верес З.Є.,"
        + "📍 322 I н.к.,  Лекція"
        + "🕓  8:30 − 10:05"
        + "~~~~~~~~~~~~~"
        + "2 Іноземна мова за професійним спрямуванням, частина 2"
        + "🎓 Кузан Г.С.,"
        + "📍 31 VII н.к.,  Практична"
        + "🕓 10:20 − 11:55"
        + "~~~~~~~~~~~~~"
        + "3 Українська мова за професійним спрямуванням"
        + "🎓 Булик-Верхола С.З.,"
        + "📍 315 VI н.к.,  Практична"
        + "🕓 12:10 − 13:45",
          2),
        "к " + "н ");
  }
  
  
  @Test
  void testSheduleTuesday() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Розклад: ІР-12"
        + "Поточний тиждень: 03.03 - 09.03"
        + "Навчання по: Знаменнику"
        + "Мої налаштування:  Чисельник - I підгрупа"
        + "Останнє оновлення: 08.03 22:38:48"
        + "~~~~~~~~~~~~~"
        + "1 Вища математика, частина3 (Математичний аналіз, частина 2)"
        + "🎓 Нитребич З.М.,"
        + "📍 321 I н.к.,  Лекція"
        + "🕓  8:30 − 10:05",
          1),
        "частина " + "I ");
  }
  
  @Test
  void testSheduleWednesday() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Розклад: ІР-12"
        + "Поточний тиждень: 03.03 - 09.03"
        + "Навчання по: Знаменнику"
        + "Мої налаштування:  Чисельник - I підгрупа"
        + "Останнє оновлення: 08.03 22:43:07"
        + "~~~~~~~~~~~~~"
        + "1 Фізичне виховання, частина 2"
        + "🎓 Не вказано"
        + "📍  Практична"
        + "🕓  8:30 − 10:05"
        + "~~~~~~~~~~~~~"
        + "2 Алгоритмізація та програмування, частина 2"
        + "🎓 Верес З.Є.,"
        + "📍 218 I н.к.,  Лекція"
        + "🕓 10:20 − 11:55",
          1),
        "частина " + "I ");
  }
  
  @Test
  void testCode() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "public static String readInputText() throws IOException {"
        + "    String out = \"\";"
        + "    try (Scanner scanner = new Scanner(System.in)) {"
        + "      System.out.print(\"Enter Text:\\n\");"
        + "      out += scanner.nextLine();"
        + "      System.out.print(\"Enter Number of times:\\n\");"
        + "      out += scanner.nextInt();"
        + "      return out;"
        + "    }"
        + "}",
          2),
          "scanner " + "System " + "out ");
  }
  
  @Test
  void testTestCode() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
            "@Test"
          + "void test1() {"
          + "Assertions.assertEquals("
          + "proc.findWordsRepeatingMoreTimesThan("
          + "    \"public static String readInputText() throws IOException {\""
          + "  + \"  String out = \\\"\\\";\""
          + "  + \"  try (Scanner scanner = new Scanner(System.in)) {\""
          + "  + \"    System.out.print(\\\"Enter Text:\\\\n\\\");\""
          + "  + \"    out += scanner.nextLine();\""
          + "  + \"    System.out.print(\\\"Enter Number of times:\\\\n\\\");\""
          + "  + \"    out += scanner.nextInt();\""
          + "  + \"    return out;\""
          + "  + \"  }\""
          + "  + \"}\","
          + "    2),"
          + "    \"System \""
          + "  + \"out \""
          + "  + \"scanner \");"
          + "  }",
          4),
        "out ");
  }
  
  @Test
  void testVeresPost1() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Жив-був студентський проект, який дуже хотів стати продуктом "
        + "￼:) Сильно хотів, запалив цією ідеєю багато людей і тепер на "
        + "цього бота можна підписатись в телеграмі і маит актуальну "
        + "інформацію про ІТ-події у Львові ￼:)  Хто з ІТ-шників вже "
        + " є в телезі - реєструйтесь, тестуйте, залишайте відгуки! "
        + "І чим більше підпишеться людей, тим швидше вони зроблять "
        + "цього бота для месенджера ￼:)",
        1),
          "в " + "бота "
        + "і " + "людей "
        + "ІТ " + "хотів "
        + "цього ");
  }
  
  @Test
  void testVeresPost2() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "+3, сумарно - 12 програм. Непоганий результат роботи за "
        + "3 роки (примазуюсь до роботи груп, очолюваних Michael "
        + "Kropyva Maksym Nechepurenko і Volodymyr Verhun)"
        + "Скидайте статті знайомим абітурієнтам - нехай приходять "
        + "на дні відкритих дверей, задають питання і обирають "
        + "що їм найбільш цікаво :)",
        1),
          "і " + "роботи ");
  }
  
  @Test
  void testLab1() {
    Assertions.assertEquals(
      proc.findWordsRepeatingMoreTimesThan(
        "Створити консольну програму мовою Java і написати клас "
      + "<Назва_із_завдання> який міститиме:     Додаткових "
      + "2 приватних поля, які найкраще описують даний клас "
      + "(додатково до полів, вказаних в таблиці)"
      + "Методи доступу до цих полів (наприклад для поля name "
      + "– getName() і setName())   Статичне поле (числового типу)"
      + "Для кожного класу слід додати 2 захищених поля (protected)"
      + "Поля з пунктів 3 і 4 мають представляти атрибути описуваного класу"
      + "Дефолтний конструктор, конструктор з чотирьма параметрами "
      + "(першими чотирьма властивостями з п.1) і конструктор з усіма полями. "
      + "При роботі з конструкторами слід переадресовувати виклик в один "
      + "з конструкторів з-за допомогою this та уникати копіювання коду"
      + "Методи:    toString - вивести інформацію про обєкт"
      + "Статичний метод printStaticField() - виводить інформацію про "
      + "значення статичного поля (де Field - назва поля)"
      + "Метод printField() - виводить інформацію про значення статичного поля"
      + "resetValues(параметри) - змінює значення всіх полів на передані "
      + "в параметрах.  Розроблений код має бути залито в гіт репозиторій! "
      + "В репозиторії мать бути README і .gitignore файл. "
      + "В main() методі визначіть 3 об’єкти типу із завдання "
      + "(з-за допомогою різних конструкторів) та виведіть інформацію про них "
      + "з-за допомогою методу toString() та виведіть інформацію за допомогою "
      + "методів printStaticField() і printField() ",
        2),
        "інформацію "
      + "в " + "допомогою "
      + "і " + "з " + "конструктор "
      + "за " + "полів " + "поля "
      + "про " + "та " + "значення ");
  }

  @Test
  void testLab2() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Лабораторне завдання складається з трьох частин, першою частиною є "
        + "намалювати UML діаграму класів   Загальні рекомендації:"
        + "Використовувати можливості ООП: класи, успадкування, поліморфізм, "
        + "інкапсуляцію. Кожний клас повинен мати назву, яка повністю описує "
        + "його суть, і інформативний склад. Атрибути і методи класів слід "
        + "визначити самостійно   Успадкування потрібно використовувати "
        + "тільки тоді, коли воно має сенс. При записі програми потрібно "
        + "використовувати домовленості щодо оформлення коду "
        + "java code convention. Зображати всі пари set/get "
        + "(ака сеттери/геттери) для атрибутів класу не потрібно з метою "
        + "уникнення засмічення діаграми   Реалізація пошуку і сортування "
        + "має використовувати лямбда-вирази   UML діаграму класів можна "
        + "малювати у draw.io, MS Visio або будь-якому іншому зручному "
        + "інструментарії. Результуючу діаграму слід залити на Google Drive "
        + "у форматі ClassDiagram_Programming_FirstName_LastName_Group.pdf "
        + "(https://drive.google.com/drive/u/0/folders/"
        + "1e63-TteHj5Q9-yPQYtu4J3aZOGgWs7ab "
        + " та додати посилання на документ в таблицю)",
        2),
      "діаграму " + "потрібно " + "і "
    + "використовувати " + "класів ");
  }
  
  @Test
  void testLab3() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Написати код до завдання з лабораторної №2"
        + "При записі програми потрібно використовувати домовленості щодо "
        + "оформлення коду java code convention."
        + "Класи потрібно грамотно розкласти по пакетах."
        + "Робота з консоллю або консольне меню повинні бути мінімальними."
        + "В коді мають бути присутні лиш ті класи, які містяться на діаграмі "
        + "класів"
        + "Атрибути класів та їх видимість мають співпадати із зазначеними на "
        + "діаграмі класів. Те саме стосується методів класів"
        + "Для сортування слід використати вбудовані методи сортування, "
        + "доступні в мові Java"
        + "Сортування слід реалізувати в окремому методі"
        + "Код немає містити статичних методів/атрибутів. Дозволено лиш "
        + "один статичний метод - main"
        + "Код має використовувати перелічувальний тип (Enum)"
        + "Код слід залити в окремий репозиторій, попередньо створивши pull "
        + "request (тобто код слід писати в окремому branch  на його основі "
        + "зробити pull request)"
        + "Реалізація порівняння елементів та їх сортування з використанням "
        + "лямбда-виразів (оцінюється додатковими 0,3 балами при здачі 15/02 "
        + "і 18/02, за умови що студент пояснив як працюють лямбди)",
          2),
          "сортування " + "в "
        + "на " + "з " + "слід ");
  }
  
  @Test
  void testLab4() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "ВАЖЛИВО: здача 4 роботи може бути виконана при наявності комітів "
        + "з 3-ї роботи та здачі 3 роботи. Здача 4 і 3 роботи одночасно "
        + "неможлива!  Перетворити проект таким чином, щоб його збірку можна "
        + "було виконувати з-за допомогою  maven. Також підключити наступні "
        + "плагіни в pom.xml "
        + "- плагін Jacoco який виконуватиме перевірку коду тестами "
        + "(в секцію build):"
        + "- плагін FindBugs який здійснює автоматичну перевірку якості коду "
        + "і пошук потенційних помилок в коді (в секцію reporting):"
        + "- плагін PMD (в секцію reporting):"
        + "- плагін Checkstyle - перевіряє дотримання code convention "
        + "(в секцію reporting):"
        + "Після завершення роботи слід виконати команду mvn site і "
        + "переглянути результати її виконання в папці target/site "
        + "(відкривши файл index.html)"
        + "В коді слід виправити всі помилки, які виявлять плагіни FindBugs, "
        + "PMD і Checkstyle (окрім помилок,повязаних з відстуністю коментарів)"
        + "Код 4 роботи слід залити в той ж репозиторій, що і код 3-ї, але це "
        + "має бути окремий pull request (але не потрібно виконувати merge)"
        + "Генерація відбувається з-за допомогою команди maven "
        + "(слід виконувати з консолі):"
        + "mvn archetype:generate -DgroupId=ua.lviv.iot -DartifactId=work "
        + "-Dversion=1.0-SNAPSHOT "
        + "-DarchetypeArtifactId=maven-archetype-quickstart "
        + "-DarchetypeVersion=1.0 -DinteractiveMode=false",
          4),
        "в " + "і " + "з " + "роботи ");
  }
  
  @Test
  void testLab5() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "тести, виконані в 5-й роботі мають бути додані до коду 4 роботи. "
        + "Покриття коду тестами має становити 70%"
        + "Код тестів слід перевірити пз використанням плагінів FindBugs, "
        + "PMD і Checkstyle та виправити всі помилки"
        + "Коміт в Github має  бути виконано як окремий pull request "
        + "(але не потрібно виконувати merge) ",
          1),
          "бути " + "має "
        + "в " + "коду ");
  }
  
  @Test
  void testLab6() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Нехай в рамках лабораторної 3 було реалізовано клас "
        + "CrocodileManager, який містить список об’єктів, похідних від класу "
        + "Crocodile. Для кожного класу, похідного від  Crocodile і в самому "
        + "класі Crocodile слід реалізувати два методи:"
        + "pubic String getHeaders() { … } - повертає стрічку з атрибутів, "
        + "присутніх в даному класі, розділеному через кому"
        + "pubic String toCSV() { ... } - повертає значення атрибутів "
        + "(значення полів), даного об'єкта, розділеного комами"
        + "Реалізація методу toCSV в дочірніх класах має викликати також цей "
        + "метод із батьківського класу. Поля, які оголошені в батьківському "
        + "класі, мають конвертуватись в стрічку, розділену комами, "
        + "в батьківському класі, наприклад:"
        + "class Crocodile  {"
        + "    private String origin;…"
        + "    pubic String getHeaders() { "
        + "         return “origin”;}}"
        + "class Aligator extends Crocodile  {"
        + "    private int maxSpeed;…"
        + "    pubic String getHeaders() { "
        + "         return super.getHeaders() + “,” + “maxSpeed”;}}",
          4),
        "в " + "Crocodile " + "String ");
  }
  
  @Test
  void testLab7() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Написати код до завдання з таблиці"
        + "При записі програми потрібно використовувати домовленості щодо "
        + "оформлення коду java code convention."
        + "Перевірку роботоздатності коду слід зробити з-за допомогою тестів"
        + "Також реалізувати можливість вичитки тексту з консолі з-за "
        + "допомогою Scanner використавши main метод "
        + "main метод має викликати метод вичитування даних з консолі, а "
        + "також створювати об’єкт, метод якого має виконувати роботу з "
        + "текстом а також метод виводу результату на консоль (showResults)"
        + "Виконання операцій над текстом слід робити з-за допомогою об'єктів "
        + "(використання статичних методів заборонено, окрім main методу та "
        + "readInputText)"
        + "Код слід залити в окремий репозиторій"
        + "Проект має бути реалізований як мейвен проект"
        + "Код не має використовувати 3-6 лабораторну",
          3),
        "має " + "з " + "метод ");
  }
  
  @Test
  void testLab10() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Створити консольну програму мовою Python і написати клас "
        + "<Назва_із_завдання> який міститиме:"
        + "Три додаткових поля, які найкраще описують даний клас"
        + "Конструктор (із вказаними дефолтними значеннями)"
        + "Деструктор"
        + "Метод, що повертає стрічкове представлення класу"
        + "Статичне поле"
        + "Статичний метод, що повертає значення статичного поля"
        + "В main() методі визначіть 3 об’єкти типу із завдання (з-за "
        + "допомогою передачі різної кількості параметрів) та виведіть "
        + "інформацію про них з-за допомогою методу з пункту 4 в консоль"
        + "Важливо: завдання має відрізнятись від того, що було на 1-й "
        + "лабораторній",
          2),
          "із " + "що " + "з "
        + "завдання ");
  }
  
  @Test
  void testLab11() {
    Assertions.assertEquals(
        proc.findWordsRepeatingMoreTimesThan(
          "Напишіть код лабораторної роботи №3 на мові Python"
        + "При написанні коду його слід організувати по папках "
        + "Слід дотримуватись code conventions для мови Python"
        + "Код слід залити в окремий репозиторій"
        + "Робити поля приватними непотрібно!",
          1),
        "слід ");
  }

}
